; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=13, locations=14, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=28, seed=69

(define (problem transport-28)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l6)
    (at p2 l14)
    (at p3 l13)
    (at p4 l13)
    (at p5 l14)
    (at p6 l9)
    (at p7 l7)
    (at p8 l8)
    (at p9 l14)
    (at p10 l7)
    (at p11 l10)
    (at p12 l8)
    (at p13 l14)
    (at v1 l9)
    (at v2 l6)
    (at v3 l9)
    (at v4 l9)
    (at v5 l13)
    )
 (:goal  (and 
    (at p1 l8)
    (at p2 l3)
    (at p3 l7)
    (at p4 l7)
    (at p5 l2)
    (at p6 l7)
    (at p7 l5)
    (at p8 l3)
    (at p9 l4)
    (at p10 l3)
    (at p11 l5)
    (at p12 l4)
    (at p13 l12))))

; plan
1. (pick-up v5 l13 p3 c1 c2)
   deleted: (at p3 l13) (capacity v5 c2)
   added: (in p3 v5) (capacity v5 c1)
   goals met: 0 of 13
2. (pick-up v5 l13 p4 c0 c1)
   deleted: (at p4 l13) (capacity v5 c1)
   added: (in p4 v5) (capacity v5 c0)
   goals met: 0 of 13
3. (drive v5 l13 l7)
   deleted: (at v5 l13)
   added: (at v5 l7)
   goals met: 0 of 13
4. (drop v5 l7 p3 c0 c1)
   deleted: (in p3 v5) (capacity v5 c0)
   added: (at p3 l7) (capacity v5 c1)
   goals met: 1 of 13
5. (drop v5 l7 p4 c1 c2)
   deleted: (in p4 v5) (capacity v5 c1)
   added: (at p4 l7) (capacity v5 c2)
   goals met: 2 of 13
6. (drive v5 l7 l3)
   deleted: (at v5 l7)
   added: (at v5 l3)
   goals met: 2 of 13
7. (pick-up v4 l9 p6 c0 c1)
   deleted: (at p6 l9) (capacity v4 c1)
   added: (in p6 v4) (capacity v4 c0)
   goals met: 2 of 13
8. (drive v4 l9 l7)
   deleted: (at v4 l9)
   added: (at v4 l7)
   goals met: 2 of 13
9. (drop v4 l7 p6 c0 c1)
   deleted: (in p6 v4) (capacity v4 c0)
   added: (at p6 l7) (capacity v4 c1)
   goals met: 3 of 13
10. (drive v4 l7 l5)
   deleted: (at v4 l7)
   added: (at v4 l5)
   goals met: 3 of 13
11. (pick-up v2 l6 p1 c0 c1)
   deleted: (at p1 l6) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 3 of 13
12. (drive v2 l6 l8)
   deleted: (at v2 l6)
   added: (at v2 l8)
   goals met: 3 of 13
13. (drive v1 l9 l12)
   deleted: (at v1 l9)
   added: (at v1 l12)
   goals met: 3 of 13
14. (drive v4 l5 l10)
   deleted: (at v4 l5)
   added: (at v4 l10)
   goals met: 3 of 13
15. (pick-up v4 l10 p11 c0 c1)
   deleted: (at p11 l10) (capacity v4 c1)
   added: (in p11 v4) (capacity v4 c0)
   goals met: 3 of 13
16. (drive v4 l10 l5)
   deleted: (at v4 l10)
   added: (at v4 l5)
   goals met: 3 of 13
17. (drop v4 l5 p11 c0 c1)
   deleted: (in p11 v4) (capacity v4 c0)
   added: (at p11 l5) (capacity v4 c1)
   goals met: 4 of 13
18. (drop v2 l8 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l8) (capacity v2 c1)
   goals met: 5 of 13
19. (pick-up v2 l8 p12 c0 c1)
   deleted: (at p12 l8) (capacity v2 c1)
   added: (in p12 v2) (capacity v2 c0)
   goals met: 5 of 13
20. (drive v2 l8 l4)
   deleted: (at v2 l8)
   added: (at v2 l4)
   goals met: 5 of 13
21. (drop v2 l4 p12 c0 c1)
   deleted: (in p12 v2) (capacity v2 c0)
   added: (at p12 l4) (capacity v2 c1)
   goals met: 6 of 13
22. (drive v4 l5 l7)
   deleted: (at v4 l5)
   added: (at v4 l7)
   goals met: 6 of 13
23. (pick-up v4 l7 p7 c0 c1)
   deleted: (at p7 l7) (capacity v4 c1)
   added: (in p7 v4) (capacity v4 c0)
   goals met: 6 of 13
24. (drive v4 l7 l5)
   deleted: (at v4 l7)
   added: (at v4 l5)
   goals met: 6 of 13
25. (drop v4 l5 p7 c0 c1)
   deleted: (in p7 v4) (capacity v4 c0)
   added: (at p7 l5) (capacity v4 c1)
   goals met: 7 of 13
26. (drive v2 l4 l14)
   deleted: (at v2 l4)
   added: (at v2 l14)
   goals met: 7 of 13
27. (pick-up v2 l14 p5 c0 c1)
   deleted: (at p5 l14) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 7 of 13
28. (drive v2 l14 l2)
   deleted: (at v2 l14)
   added: (at v2 l2)
   goals met: 7 of 13
29. (drop v2 l2 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l2) (capacity v2 c1)
   goals met: 8 of 13
30. (drive v1 l12 l7)
   deleted: (at v1 l12)
   added: (at v1 l7)
   goals met: 8 of 13
31. (pick-up v1 l7 p10 c0 c1)
   deleted: (at p10 l7) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 8 of 13
32. (drive v2 l2 l12)
   deleted: (at v2 l2)
   added: (at v2 l12)
   goals met: 8 of 13
33. (drive v1 l7 l3)
   deleted: (at v1 l7)
   added: (at v1 l3)
   goals met: 8 of 13
34. (drop v1 l3 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l3) (capacity v1 c1)
   goals met: 9 of 13
35. (drive v2 l12 l14)
   deleted: (at v2 l12)
   added: (at v2 l14)
   goals met: 9 of 13
36. (pick-up v2 l14 p13 c0 c1)
   deleted: (at p13 l14) (capacity v2 c1)
   added: (in p13 v2) (capacity v2 c0)
   goals met: 9 of 13
37. (drive v2 l14 l12)
   deleted: (at v2 l14)
   added: (at v2 l12)
   goals met: 9 of 13
38. (drop v2 l12 p13 c0 c1)
   deleted: (in p13 v2) (capacity v2 c0)
   added: (at p13 l12) (capacity v2 c1)
   goals met: 10 of 13
39. (drive v1 l3 l8)
   deleted: (at v1 l3)
   added: (at v1 l8)
   goals met: 10 of 13
40. (pick-up v1 l8 p8 c0 c1)
   deleted: (at p8 l8) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 10 of 13
41. (drive v2 l12 l14)
   deleted: (at v2 l12)
   added: (at v2 l14)
   goals met: 10 of 13
42. (drive v1 l8 l3)
   deleted: (at v1 l8)
   added: (at v1 l3)
   goals met: 10 of 13
43. (drop v1 l3 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l3) (capacity v1 c1)
   goals met: 11 of 13
44. (pick-up v2 l14 p9 c0 c1)
   deleted: (at p9 l14) (capacity v2 c1)
   added: (in p9 v2) (capacity v2 c0)
   goals met: 11 of 13
45. (drive v2 l14 l4)
   deleted: (at v2 l14)
   added: (at v2 l4)
   goals met: 11 of 13
46. (drop v2 l4 p9 c0 c1)
   deleted: (in p9 v2) (capacity v2 c0)
   added: (at p9 l4) (capacity v2 c1)
   goals met: 12 of 13
47. (drive v1 l3 l14)
   deleted: (at v1 l3)
   added: (at v1 l14)
   goals met: 12 of 13
48. (pick-up v1 l14 p2 c0 c1)
   deleted: (at p2 l14) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 12 of 13
49. (drive v1 l14 l3)
   deleted: (at v1 l14)
   added: (at v1 l3)
   goals met: 12 of 13
50. (drop v1 l3 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l3) (capacity v1 c1)
   goals met: 13 of 13
